{
  "self_discovery": [
    "What parts of yourself do you hide from others, and why?",
    "If you could change one thing about your past, what would it be and how might it alter your present?",
    "What activity makes you lose track of time completely?",
    "Describe a moment when you felt truly proud of yourself.",
    "What limiting belief is holding you back the most right now?",
    "What are you most grateful for in your life at this moment?",
    "If you weren't afraid, what would you do differently?",
    "What does 'success' truly mean to you, beyond societal expectations?",
    "In what ways do you self-sabotage, and how can you stop?",
    "What is a talent you have that you wish you utilized more?"
  ],
  "philosophical_reflection": [
    "Is free will real or just an elaborate construct of our consciousness?",
    "If happiness is the goal, what is the most ethical way to pursue it?",
    "Does technology ultimately bring us closer together or drive us further apart?",
    "What is the nature of consciousness, and can it exist outside a physical body?",
    "Is there an objective morality, or is it entirely subjective and cultural?",
    "What is the value of art in society?",
    "If you could know the absolute truth to one question, what would you ask?",
    "How does language shape our perception of reality?",
    "What responsibilities do we have towards future generations?",
    "Is knowledge always a good thing?"
  ],
  "emotional_depth": [
    "When did you last feel truly vulnerable, and what did you learn from it?",
    "Describe an emotion you find difficult to express, and why.",
    "What does compassion mean to you, both for others and for yourself?",
    "How do you cope with feelings of sadness or loss?",
    "What memory evokes the strongest sense of joy in you?",
    "When have you felt misunderstood, and how did it impact you?",
    "What does forgiveness look like to you?",
    "Describe a time you felt a deep connection with nature.",
    "What is your earliest memory of feeling a strong emotion?",
    "How does music affect your emotional state?"
  ],
  "relationship_trust": [
    "What does loyalty mean to you in a friendship or romantic relationship?",
    "How do you define 'trust' and what does it take to earn yours?",
    "Describe a time when your trust was broken. How did you heal?",
    "What is the most important quality you look for in a partner or friend?",
    "How do you communicate your needs and boundaries in relationships?",
    "What does a healthy relationship look and feel like to you?",
    "When did you last feel truly connected and understood by someone?",
    "How do you handle conflict in your important relationships?",
    "What role does empathy play in building strong bonds?",
    "Is it more important to be loved or to love?"
  ],
  "existential_doubt": [
    "Do you think life has inherent meaning, or do we create our own meaning?",
    "What are your thoughts on what happens after death?",
    "If you knew this was your last year to live, what would you change?",
    "What is your biggest fear about the future?",
    "How do you find purpose in your daily life?",
    "Does the vastness of the universe make you feel small or connected?",
    "What legacy do you hope to leave behind?",
    "Are humans fundamentally good, evil, or neutral?",
    "If there's no grand plan, how do you find motivation?",
    "What is the role of suffering in human existence?"
  ]
}
